&НаКлиенте
Перем АдресФайлаВХранилище,ФормаОжидания,ПрогрессВыполнения,ВыводитьСообщения;
&НаКлиенте
Процедура ПередВыполнениемЗагрузки()
	
	ФормаОжидания="Показывать";
	ПрогрессВыполнения=Ложь;
	ВыводитьСообщения=Истина;
	
	ОчиститьСообщения();
	
	Если ФормаОжидания = "Показывать" Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУведомление;
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
		ТекстУведомления = НСтр("ru = 'Пожалуйста, подождите...'");
		Если Не ПустаяСтрока(Уведомление) Тогда
			ТекстУведомления = Уведомление + Символы.ПС + ТекстУведомления;
		КонецЕсли;
		Элементы.ДлительнаяОперация.РасширеннаяПодсказка.Заголовок = ТекстУведомления;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 Начало выполнения %2...'"), 
		ОбщегоНазначенияКлиент.ДатаСеанса(), "Загрузка классификатора из Файла"));
	
КонецПроцедуры 
&НаКлиенте
Процедура ВыполнитьЗагрузкуИзФайла()
	
	ПередВыполнениемЗагрузки();
	
	ДлительнаяОперация = НачатьВыполнениеЗагрузкиИзФайла(АдресФайлаВХранилище);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗагрузкиИзФайла", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗагрузкиИзФайла(Результат,пПар2) Экспорт
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СписокСправочника;
	Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	ВывестиРезультатЗагрузкиИзФайла(Результат);
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ВывестиРезультатЗагрузкиИзФайла(Результат)
	
	Если Результат.Статус = "Выполнено" Тогда
		Если Результат.Свойство("АдресРезультата") И ЗначениеЗаполнено(Результат.АдресРезультата) Тогда
			ТекстСообщения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Иначе
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Действие %1 успешно выполнено'"), "Загрузка справочника из файла");
		КонецЕсли;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = Результат.ПодробноеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'"), ТекущаяДатаСеанса(), ТекстСообщения));
	
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеЗагрузкиИзФайла(пАдресФайлаВХранилище)
	Данные = ПолучитьИзВременногоХранилища(пАдресФайлаВХранилище);
	// Получение имени временного файла
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("zip");
	// Сохранение данных во временный файл
	Данные.Записать(ИмяВременногоФайла);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(, 
		"Справочники.МЗРФ_МКБ.ВыполнитьЗагрузкуИзФайла", 
		ИмяВременногоФайла);
		
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("Заголовок", НСтр("ru = ‘Выберите файл ZIP'"));
	ПараметрыДиалога.Вставить("Фильтр", НСтр("ru=’Файл ZIP (*.zip)|*.zip'"));
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтотОбъект);
	ОбменДаннымиКлиент.ВыбратьИПередатьФайлНаСервер(Оповещение, ПараметрыДиалога, УникальныйИдентификатор);	
КонецПроцедуры
&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(Знач РезультатПомещенияФайлов, 
	Знач ДополнительныеПараметры) Экспорт
	Адрес = РезультатПомещенияФайлов.Хранение;
	ТекстОшибки = РезультатПомещенияФайлов.ОписаниеОшибки;
	//@skip-warning
	ИмяВыбранногоФайла = РезультатПомещенияФайлов.Имя;
	Если ПустаяСтрока(ТекстОшибки) И ПустаяСтрока(Адрес) Тогда
		ТекстОшибки = НСтр("ru = ‘Ошибка передачи файла на сервер'");
	КонецЕсли;
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	АдресФайлаВХранилище=Адрес;
	ВыполнитьЗагрузкуИзФайла();
КонецПроцедуры
&НаКлиенте
Функция ПараметрыОжидания()
	
	Перем ОповещениеОПрогрессеВыполнения, ПараметрыОжидания;
	Если (ПрогрессВыполнения Или ВыводитьСообщения) И (ФормаОжидания <> "Показывать") Тогда
		//@skip-warning
		ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ВыполнитьДействиеПрогрессВыполнения", ЭтотОбъект);
	Иначе
		ОповещениеОПрогрессеВыполнения = Неопределено;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = Уведомление;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = ПрогрессВыполнения;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = "e1cib/app/Справоник.МЗРФ_МКБ";
	ПараметрыОжидания.ВыводитьОкноОжидания = (ФормаОжидания = "Показывать");
	ПараметрыОжидания.ВыводитьСообщения = ВыводитьСообщения;
	Возврат ПараметрыОжидания;

КонецФункции

