&НаСервереБезКонтекста
Функция ПолучитьТаблицуУслуг(пСсылка)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	SK007Услуги.CODE_USL КАК КодУслуги,
	|	V003.NAME КАК Услуга,
	|	SK007Услуги.НомерСтроки КАК НомерСтроки,
	|	V003.ID,
	|	V003.IERARH,
	|	V003.IS_GROUP,
	|	V003.DATE_BEG,
	|	V003.DATE_END
	|ИЗ
	|	Справочник.SK007.Услуги КАК SK007Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.V003 КАК V003
	|		ПО SK007Услуги.CODE_USL = V003.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.SK007 КАК SK007
	|		ПО SK007Услуги.Ссылка = SK007.Ссылка
	|ГДЕ
	|	SK007.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Услуга ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("Ссылка",пСсылка);
	
	пРез=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Возврат пРез;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	пТЗ=ПолучитьТаблицуУслуг(Объект.Ссылка);
	ЗначениеВРеквизитФормы(пТЗ,"ТЗУслуги");
	
КонецПроцедуры
