&НаСервере
Функция ПолучитьКодЭлементаНаСервере()
	пТекСтр=Элементы.Список.ТекущаяСтрока;
	Если пТекСтр=Неопределено Тогда
		Возврат "";
	КонецЕсли;
	пТекОбъект=пТекСтр.ПолучитьОбъект();
	Если пТекОбъект.ЭтоГруппа Тогда
		Возврат "";
	КонецЕсли;
	Возврат СОКРЛП(пТекОбъект.Код);
КонецФункции	
&НаКлиенте
Процедура ОткрытьСправочник(Команда)
	пКод=ПолучитьКодЭлементаНаСервере();
	Если ПустаяСтрока(пКод) Тогда
		Возврат;
	КонецЕсли;	
	Попытка
		ОткрытьФорму("Справочник."+пКод+".ФормаСписка");
	Исключение
		Предупреждение("Этот справочник не загружен в систему!",5);		
	КонецПопытки;		
КонецПроцедуры

&НаСервере
Функция ПолучитьФайлНаСервере(пИмяФайла)
	пТекСтр=Элементы.Список.ТекущаяСтрока;
	Если пТекСтр=Неопределено Тогда
		Возврат "";
	КонецЕсли;
	пТекОбъект=пТекСтр.ПолучитьОбъект();
	Если пТекОбъект.ЭтоГруппа Тогда
		Возврат "";
	КонецЕсли;
	пПапка=ОбщегоНазначенияПУМПСервер.ПолучитьПапкуДанных()+
		ПолучитьРазделительПутиСервера()+"STORAGE";
	пИмяФайла=СОКРЛП(пТекОбъект.Код)+".xml";
	пИмяФайлаПолное=пПапка+ПолучитьРазделительПутиСервера()+пИмяФайла;	
	пФайл=Новый Файл(пИмяФайлаПолное);
	Если НЕ пФайл.Существует() Тогда
		Возврат "";
	КонецЕсли;
	пДвоичныеДанные=Новый ДвоичныеДанные(пИмяФайлаПолное);
	пАдрес=ПоместитьВоВременноеХранилище(пДвоичныеДанные,
		ЭтаФорма.УникальныйИдентификатор);
	Возврат пАдрес;			 
КонецФункции
&НаКлиенте
//@skip-warning
Процедура ЗапускПриложенияЗавершение(КодВозврата,ДопПараметры) Экспорт
	//
КонецПроцедуры
//@skip-warning
&НаКлиенте
Процедура ПолучениеФайловЗавершение(ПолученныеФайлы,ДопПараметры) Экспорт
	Если ПолученныеФайлы=Неопределено Тогда
		Предупреждение("Не удалось получить файл с сервера!");
		Возврат;
	КонецЕсли;
	пФайл=ПолученныеФайлы[0].ПолноеИмя;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗапускПриложенияЗавершение", ЭтаФорма);
	НачатьЗапускПриложения(ОписаниеОповещения,пФайл,,Ложь);	
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьФайлСправочника(Команда)
	пИмяФайла="";
	пАдрес=ПолучитьФайлНаСервере(пИмяФайла);
	Если НЕ ЭтоАдресВременногоХранилища(пАдрес) Тогда
		Предупреждение("Не удалось получить файл с сервера!");
		Возврат;
	КонецЕсли;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеФайловЗавершение", ЭтаФорма);
    
	Файл = Новый ОписаниеПередаваемогоФайла(пИмяФайла, пАдрес);
    
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(Файл);
    
//	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
//	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
    
	НачатьПолучениеФайлов(ОписаниеОповещения,
		ПолучаемыеФайлы, КаталогВременныхФайлов(), Ложь);

КонецПроцедуры




