Функция СведенияОВнешнейОбработке() Экспорт
       ДанныеДляРег = Новый Структура();
       ДанныеДляРег.Вставить("Наименование","Внешняя обработка ЕИР");
       ДанныеДляРег.Вставить("Информация","Внешняя обработка ЕИР");
       ДанныеДляРег.Вставить("БезопасныйРежим", Ложь);
       ДанныеДляРег.Вставить("Версия", "ver.: 1.001");
       ДанныеДляРег.Вставить("Вид", "ДополнительнаяОбработка");
       ТабЗнКоманды = Новый ТаблицаЗначений;
       ТабЗнКоманды.Колонки.Добавить("Идентификатор");
       ТабЗнКоманды.Колонки.Добавить("Использование");
       ТабЗнКоманды.Колонки.Добавить("Представление");
       НовСтрока = ТабЗнКоманды.Добавить();
       НовСтрока.Идентификатор = "ВнешняяОбработкаЕИР";
       НовСтрока.Использование = "ОткрытиеФормы";
       НовСтрока.Представление = "Внешняя обработка ЕИР";
       ДанныеДляРег.Вставить("Команды", ТабЗнКоманды);
       Возврат ДанныеДляРег;
КонецФункции