// Параметры:пЧисло-Число,пДлина-Число
// Возвращаемое значение:StrZero(13,5)="00013"
Функция StrZero(пЧисло,пДлина) Экспорт
	Возврат ФОРМАТ(пЧисло, "ЧЦ="+Строка(пДлина)+" ; ЧВН=; ЧГ=0");
КонецФункции	
// Параметры:пДата-дата
// Возвращаемое значение:DTOS('06.03.1965')="19650306"
Функция DTOS(пДата) Экспорт
	пСтр="";
	Если (Не (пДата=Неопределено)) Тогда
		пСтр=StrZero(Год(пДата),4)+StrZero(Месяц(пДата),2)+StrZero(День(пДата),2);			
	КонецЕсли;
	Возврат пСтр;	
КонецФункции	
//@skip-warning
// Параметры:пСтрЗнач-Строка, пРазделитель-булево (есть ли разделитель)
// Возвращаемое значение:STOD("19650306")='03.06.1965', STOD("1965-03-06",Истина)='03.06.1965' 
Функция STOD(пСтрЗнач,пРазделитель=Ложь) Экспорт 
	Перем пДата;
	Попытка
		пДата=Дата(Число(Лев(пСтрЗнач,4)),
			 Число(Сред(пСтрЗнач,6,2)),
			 Число(Прав(пСтрЗнач,2)));
	Исключение
		пДата=Неопределено;		 
	КонецПопытки;
	Возврат пДата;
КонецФункции	
