&НаСервереБезКонтекста
Функция ПолучитьИмяУсловий(идУсловия)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	V006.NAME,
	|	V006.DATE_BEG,
	|	V006.DATE_END
	|ИЗ
	|	Справочник.V006 КАК V006
	|ГДЕ
	|	V006.ID = &ID";
	Запрос.УстановитьПараметр("ID",идУсловия);
	пРез=Запрос.Выполнить().Выгрузить();
	Возврат пРез;
КонецФункции	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем пНаименование;
	пНаименование="";
	пТЗ=ПолучитьИмяУсловий(Объект.ID_USLOV);
	Если пТЗ.Количество()>0 Тогда
		пСтрока=пТЗ.Получить(0);
		пНаименование=пСтрока["NAME"];
	КонецЕсли;		
	ЭтотОбъект.NAME_USLOV=пНаименование;
КонецПроцедуры
