

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установим условное оформление
	ОбщегоНазначенияПУМПСервер.УстановитьУсловноеФорматированиеВСпискеНСИ(Список,"DATE_END");
	//
	Если 1=2 Тогда
	Запрос=Новый Запрос;
	пТекстЗапроса=
	"ВЫБРАТЬ
	|	V004_D.Код,
	|	V004_D.ID,
	|	V004_D.NAME,
	|	V004_D.SPECIALMED,
	|	V004_D.DATE_BEG,
	|	V004_D.DATE_END,
	|	V004_D.ДатаСоздания,
	|	V004_D.ДатаИзменения,
	|	V004.NAME КАК SPEC_NAME
	|ИЗ
	|	Справочник.V004_D КАК V004_D
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.V004 КАК V004
	|		ПО V004_D.SPECIALMED = V004.ID";
	Запрос.Текст=пТекстЗапроса;
	пТЗ=Запрос.Выполнить().Выгрузить();
	ЗначениеВДанныеФормы(пТЗ,Список);
	КонецЕсли;
КонецПроцедуры
