

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установим условное оформление
	ОбщегоНазначенияПУМПСервер.УстановитьУсловноеФорматированиеВСпискеНСИ(Список,"DATE_END");
	//
    ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить(); 
    пПоле=ЭлементОформления.Поля.Элементы.Добавить();
    пПоле.Поле=Новый ПолеКомпоновкиДанных("SPECIALMED");    
    пПоле=ЭлементОформления.Поля.Элементы.Добавить();
    пПоле.Поле=Новый ПолеКомпоновкиДанных("SPEC_NAME");    
    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("SPEC_DATE_END");   
    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;    
    ЭлементОтбора.ПравоеЗначение = Истина;
    ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;

    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("SPEC_DATE_END");   
    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;    
    ЭлементОтбора.ПравоеЗначение = НачалоДня(ТекущаяДата());
    ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.РозовоКоричневый);
//	ЭлементОформления.Представление = "СозданПрограммно";

	ЭлементОформления.РежимОтображения= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементОформления.ИдентификаторПользовательскойНастройки="SPEC_DATE_END";
	
КонецПроцедуры
