
&НаСервере
Функция ВыполнитьЗапрос(пКод)
	
КонецФункции	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	пТЗ=ВыполнитьЗапрос(Объект.Код);
	пТЗ=Объект.Подразделения.Выгрузить();
	пТЗ.Колонки.Добавить("ПГБ2_NAME_BRANCH");
	Спр=Справочники.F003_T.Выбрать();
	Пока Спр.Следующий() Цикл
		пОтбор=Новый Структура;
		пОтбор.Вставить("TYPE_BRANCH",Спр.ID);
		пМассив=пТЗ.НайтиСтроки(пОтбор);
		Для Каждого пСтр ИЗ пМассив Цикл
			пСтр.ПГБ2_NAME_BRANCH=Спр.NAME;
		КонецЦикла;
		
	КонецЦикла;	
	ЭтаФорма.ТолькоПросмотр=Истина;
	ЗначениеВРеквизитФормы(пТЗ,"ТЗПодразделения");
КонецПроцедуры
