#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ВыполнитьЗагрузкуИзФайла(ИмяВременногоФайла) Экспорт
	
	
	// Обработка файла…
	Архив = Новый ЧтениеZipФайла(
		ИмяВременногоФайла,
        "" // пароль к архиву
    );	
    Для Каждого Элемент Из Архив.Элементы Цикл
		ОбщегоНазначения.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ИмяФайла=%1'"), Элемент.Имя));
	    	
        Архив.Извлечь(
            Элемент, // элемент для извлечения
            КаталогВременныхФайлов(),
            РежимВосстановленияПутейФайловZIP.НеВосстанавливать,
            "" // пароль
        );
	КонецЦикла; 
	Архив.Закрыть();

	Соединение = Новый HTTPСоединение(
        "tfomssk.ru", // сервер (хост)
        443, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        , // таймаут в секундах, 0 или пусто - не устанавливать
       Новый ЗащищенноеСоединениеOpenSSL()
    );
	// Get-запрос к ресурсу на сервере.
    Запрос = Новый HTTPЗапрос("/files/nsi/SpravNSI.zip");
    Результат = Соединение.Получить(Запрос);	
	
	// Хорошим тоном будет удалить временный файл
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
	КонецПопытки;	
КонецПроцедуры

#КонецЕсли