

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ссылка=Объект.Ссылка;
	Если  ССылка.Пустая() Тогда
		Возврат;
	КонецЕсли;		
	Запрос=Новый Запрос;
	Запрос.Текст=(
	"ВЫБРАТЬ
	|	F003_O.MCOD,
	|	F003_O.ID_PODR КАК ID_PODR,
	|	F003_O.Ссылка,
	|	F003_O.USL_OK,
	|	F003_O.PROF,
	|	V002.NAME КАК PROF_NAME,
	|	V002.Ссылка КАК PROF_REF,
	|	V006.NAME КАК USL_OK_NAME,
	|	V006.Ссылка КАК USL_OK_REF,
	|	F003.NAME КАК MCOD_NAME,
	|	F003.Ссылка КАК MCOD_REF,
	|	F003.Подразделения КАК Подразделения
	|ИЗ
	|	Справочник.F003_O КАК F003_O
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.F003 КАК F003
	|		ПО F003_O.MCOD = F003.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.V006 КАК V006
	|		ПО V006.ID = F003_O.USL_OK
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.V002 КАК V002
	|		ПО V002.ID = F003_O.PROF
	|ГДЕ
	|	F003_O.Ссылка = &Ссылка"
	);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТЗ=Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество()>0 Тогда
		СтрТЗ=ТЗ[0];
		MCOD_NAME=СтрТЗ.MCOD_NAME;
		USL_OK_NAME=СтрТЗ.USL_OK_NAME;
		PROF_NAME=СтрТЗ.PROF_NAME;
		MCOD_REF=СтрТЗ.MCOD_REF;
		USL_OK_REF=СтрТЗ.USL_OK_REF;
		PROF_REF=СтрТЗ.PROF_REF;
		
		Для Каждого Стр ИЗ СтрТЗ.Подразделения Цикл
			Если Стр.ID_PODR=СтрТЗ.ID_PODR Тогда
				ID_PODR_NAME=Стр.NAME_PODR;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура MCOD_NAMEНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	пСсылка=MCOD_REF;
	Попытка
		ПараметрыФормы = Новый Структура("Ключ", пССылка);
		ОткрытьФорму("Справочник.F003.ФормаОбъекта", ПараметрыФормы);
	Исключение
	КонецПопытки;
			
КонецПроцедуры

&НаКлиенте
Процедура ID_PODR_NAMEНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	пСсылка=MCOD_REF;
	Попытка
		ПараметрыФормы = Новый Структура("Ключ", пССылка);
		ОткрытьФорму("Справочник.F003.ФормаОбъекта", ПараметрыФормы);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура USL_OK_NAMEНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	пСсылка=USL_OK_REF;
	Попытка
		ПараметрыФормы = Новый Структура("Ключ", пССылка);
		ОткрытьФорму("Справочник.V006.ФормаОбъекта", ПараметрыФормы);
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура PROF_NAMEНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	пСсылка=PROF_REF;
	Попытка
		ПараметрыФормы = Новый Структура("Ключ", пССылка);
		ОткрытьФорму("Справочник.V002.ФормаОбъекта", ПараметрыФормы);
	Исключение
	КонецПопытки;
КонецПроцедуры





